import { Song } from './types';

export const PLAYLIST: Song[] = [
  {
    id: 'custom-1',
    title: "I'M NOT a SINGER - Single",
    artist: '痞客邦設計部',
    coverUrl: "https://demo.cwchang.design/campaigns/cover.jpg",
    audioUrl: "https://demo.cwchang.design/campaigns/I'M-NOT-a-SINGER-Single.mp3"
  }
];

export const CUSTOM_LYRICS_LRC = `
[00:01.25]I'M NOT a SINGER - Single
[00:04.51]Lyrics / Gemini
[00:06.83]Music / SUNO
[00:08.00]設計部的光芒
[00:09.96]從管理層開始放亮
[00:11.91]阿勤在這裡掌舵
[00:13.90]是我們的部門大頭
[00:15.68]方向他設好
[00:17.54]Vera 和 Jimmy 緊接著上場
[00:20.13]用設計來定錨
[00:22.05]從視覺的草稿，到最終的定調
[00:23.86]細節不放掉
[00:25.96]
[00:26.61]Design Dept. Flow
[00:27.95]痞客邦的部落格
[00:28.97]我們重新打造
[00:30.03]這不是普通的團隊
[00:31.32]是 UI 和 Code 的熱情交好
[00:33.15]Allen 的 Code
[00:35.07]Kendi 的 UI，每個環節都不能少
[00:37.80]這塊設計土地
[00:39.95]我們耕耘
[00:42.12]讓創意開花結果！
[00:44.27]
[00:44.66]Need some motion? Need some flair?
[00:46.44]讓畫面動起來！
[00:48.13]Gary 跟 Michelle 出手
[00:50.45]插畫跟動畫
[00:53.17]讓頁面活過來
[00:54.37]別忘了後盾
[00:55.74]那位冷靜的邏輯家 Allen
[00:59.07]撐起工程師的職責
[01:01.02]讓設計能準確實裝
[01:03.43]不出差
[01:05.39]
[01:05.87]使用者體驗 (UX)
[01:07.86]我們絕不妥協
[01:10.17]從不偷懶 小Yi 和 Phoebe 的 UI 功力
[01:13.05]讓點擊變得簡單
[01:15.55]介面流暢，風格優雅
[01:18.22]讓用戶愛不釋手
[01:20.10]最後一塊拼圖
[01:21.35]是部門的行政後勤
[01:23.17]奕婷的細心
[01:24.70]
[01:24.93]痞客邦的部落格
[01:26.85]我們重新打造
[01:28.08]這不是普通的團隊
[01:29.26]是 UI 和 Code 的熱情交好
[01:31.06]Allen 的 Code
[01:33.40]Kendi 的 UI，每個環節都不能少
[01:35.62]這塊設計土地
[01:37.81]我們耕耘
[01:40.08]讓創意開花結果！
[01:41.47]
[01:42.02]Need some motion? Need some flair?
[01:44.23]讓畫面動起來！
[01:46.77]Gary 跟 Michelle 出手
[01:48.48]插畫跟動畫
[01:50.61]讓頁面活過來
[01:52.19]別忘了後盾
[01:53.40]那位冷靜的邏輯家 Allen
[01:56.72]撐起工程師的職責
[01:58.17]讓設計能準確實裝
[02:00.85]不出差
[02:03.10]
[02:04.01]從日出到夜
[02:10.00]我們都在這
[02:12.38]把創意化為現實
[02:17.82]阿勤、Vera、Jimmy
[02:19.85]Gary、Michelle、Allen
[02:21.08]Kendi、小Yi
[02:22.15]Phoebe、奕婷
[02:26.26]這是痞客邦設計部
[02:28.00]Design Dept.，The Best Flow!
[02:30.32]Need some motion? Need some flair?
[02:33.10]讓畫面動起來！
[02:35.49]Gary 跟 Michelle 出手
[02:37.54]插畫跟動畫
[02:39.98]讓頁面活過來
[02:41.23]別忘了後盾
[02:42.70]那位冷靜的邏輯家 Allen
[02:44.70]撐起工程師的職責
[02:47.77]讓設計能準確實裝
[03:51.67]不出差
[02:47.25]
[02:49.74]Need some motion? Need some flair?
[02:51.12]讓畫面動起來！
[02:53.22]Gary 跟 Michelle 出手
[02:55.33]插畫跟動畫
[02:57.69]讓頁面活過來
[02:58.94]別忘了後盾
[03:00.32]那位冷靜的邏輯家 Allen
[03:03.40]撐起工程師的職責
[03:04.77]讓設計能準確實裝
[03:08.67]不出差
`;
